#include <stdio.h>
#include <stdlib.h>

int main()
{
 int i = 0, j = 0, k = 0; /* for迴圈便量 兼容舊版c99前編譯器用 */

 // 輸出
 for (i = 1; i <= 10; i++)
 { /* 一層一層做 從 (層數 = 1) 到 (層數 = 10) <- 這邊順輸出 */
   //第 i 層空格共需要 (10 - i) 個
  for (j = 1; j <= 10 - i; j++)
   printf(" ");

  // 星星等差數列 (首項 = 1) (公差 = 2) (項數 = 10)
  for (k = 1; k <= 1 + 2 * (i - 1); k++)
   printf("*");

  printf("\n");
 }

 for (i = 9; i > 0; i--)
 { /* 一層一層做 從 (層數 = 9) 到 (層數 = 1) <- 這邊反輸出 */
   //第 i 層空格共需要 (10 - i) 個
  for (j = 1; j <= 10 - i; j++)
   printf(" ");

  // 星星等差數列 (首項 = 1) (公差 = 2) (項數 = 9) 因為反輸出，會從末項開始輸出
  for (k = 1; k <= 1 + 2 * (i - 1); k++)
   printf("*");

  printf("\n");
 }

 // 保持顯示輸出
 system("Pause");

 return 0;
}